; domain
(define (domain p2)
(:requirements :strips :typing)

(:types 
    location 
    crate 
    content
    person
    drone
    carrier
    num
) 

(:predicates 
    (person-at ?person - person ?location - location)
    (crate-at ?crate - crate ?location - location)
    (content-crate ?content - content ?crate - crate)
    (has-content-person ?person - person ?content - content)
    (drone-at ?drone - drone ?location - location)
    (carrier-at ?carrier - carrier ?location - location)
    (next-num ?numA - num ?numB - num) 
    (in-carrier ?crate - crate ?carrier - carrier)
    (crates-in-carrier ?carrier - carrier ?n - num)
    (carrier-capacity ?carrier - carrier ?n - num)
)

(:action put-crate-in-carrier
    :parameters (
        ?crate - crate
        ?location - location
        ?drone - drone
        ?carrier - carrier
        ?n_current - num
        ?n_next - num
    )
    :precondition (and                 
        (drone-at ?drone ?location)       
        (crate-at ?crate ?location)
        (carrier-at ?carrier ?location) 
        (crates-in-carrier ?carrier ?n_current)
        (next-num ?n_current ?n_next)
    )
    :effect (and
        (not (crates-in-carrier ?carrier ?n_current))
        (crates-in-carrier ?carrier ?n_next)
        (in-carrier ?crate ?carrier)        
        (not (crate-at ?crate ?location))    
    )
)

(:action move-carrier
    :parameters (
        ?location_from - location
        ?location_to - location
        ?drone - drone
        ?carrier - carrier
    )
    :precondition (and 
        (drone-at ?drone ?location_from)
        (carrier-at ?carrier ?location_from)  
    )
    :effect (and 
        (not (drone-at ?drone ?location_from))
        (drone-at ?drone ?location_to)
        (not (carrier-at ?carrier ?location_from))
        (carrier-at ?carrier ?location_to)     
    )
)

(:action pick-and-drop
    :parameters (
        ?crate - crate
        ?location - location
        ?drone - drone
        ?carrier - carrier
        ?person - person
        ?content - content 
        ?n_current - num
        ?n_prev - num
    )
    :precondition (and                 
        (drone-at ?drone ?location)       
        (carrier-at ?carrier ?location)
        (in-carrier ?crate ?carrier)
        (person-at ?person ?location)           
        (content-crate ?content ?crate) 
        (crates-in-carrier ?carrier ?n_current)
        (next-num ?n_prev ?n_current)
    )
    :effect (and
        (not (crates-in-carrier ?carrier ?n_current))
        (crates-in-carrier ?carrier ?n_prev)
        (not (in-carrier ?crate ?carrier))        
        (has-content-person ?person ?content)   
    )
)
)

; problem
(define (problem drone_problem_d1_r1_l27_p27_c27_g27_ct2)
(:domain p2)
(:objects
	drone1 - drone
	depot - location
	loc1 - location
	loc2 - location
	loc3 - location
	loc4 - location
	loc5 - location
	loc6 - location
	loc7 - location
	loc8 - location
	loc9 - location
	loc10 - location
	loc11 - location
	loc12 - location
	loc13 - location
	loc14 - location
	loc15 - location
	loc16 - location
	loc17 - location
	loc18 - location
	loc19 - location
	loc20 - location
	loc21 - location
	loc22 - location
	loc23 - location
	loc24 - location
	loc25 - location
	loc26 - location
	loc27 - location
	crate1 - crate
	crate2 - crate
	crate3 - crate
	crate4 - crate
	crate5 - crate
	crate6 - crate
	crate7 - crate
	crate8 - crate
	crate9 - crate
	crate10 - crate
	crate11 - crate
	crate12 - crate
	crate13 - crate
	crate14 - crate
	crate15 - crate
	crate16 - crate
	crate17 - crate
	crate18 - crate
	crate19 - crate
	crate20 - crate
	crate21 - crate
	crate22 - crate
	crate23 - crate
	crate24 - crate
	crate25 - crate
	crate26 - crate
	crate27 - crate
	food - content
	medicine - content
	person1 - person
	person2 - person
	person3 - person
	person4 - person
	person5 - person
	person6 - person
	person7 - person
	person8 - person
	person9 - person
	person10 - person
	person11 - person
	person12 - person
	person13 - person
	person14 - person
	person15 - person
	person16 - person
	person17 - person
	person18 - person
	person19 - person
	person20 - person
	person21 - person
	person22 - person
	person23 - person
	person24 - person
	person25 - person
	person26 - person
	person27 - person
	carrier1 - carrier
	N0 - num
	N1 - num
	N2 - num
	N3 - num
	N4 - num
	N5 - num
	N6 - num
	N7 - num
)
(:init
	(drone-at drone1 depot)
	(crate-at crate1 depot)
	(crate-at crate2 depot)
	(crate-at crate3 depot)
	(crate-at crate4 depot)
	(crate-at crate5 depot)
	(crate-at crate6 depot)
	(crate-at crate7 depot)
	(crate-at crate8 depot)
	(crate-at crate9 depot)
	(crate-at crate10 depot)
	(crate-at crate11 depot)
	(crate-at crate12 depot)
	(crate-at crate13 depot)
	(crate-at crate14 depot)
	(crate-at crate15 depot)
	(crate-at crate16 depot)
	(crate-at crate17 depot)
	(crate-at crate18 depot)
	(crate-at crate19 depot)
	(crate-at crate20 depot)
	(crate-at crate21 depot)
	(crate-at crate22 depot)
	(crate-at crate23 depot)
	(crate-at crate24 depot)
	(crate-at crate25 depot)
	(crate-at crate26 depot)
	(crate-at crate27 depot)
	(carrier-at carrier1 depot)
	(carrier-capacity carrier1 N4)
	(crates-in-carrier carrier1 N0)
	(content-crate food crate1)
	(content-crate food crate2)
	(content-crate food crate3)
	(content-crate food crate4)
	(content-crate food crate5)
	(content-crate food crate6)
	(content-crate food crate7)
	(content-crate food crate8)
	(content-crate food crate9)
	(content-crate food crate10)
	(content-crate food crate11)
	(content-crate food crate12)
	(content-crate food crate13)
	(content-crate medicine crate14)
	(content-crate medicine crate15)
	(content-crate medicine crate16)
	(content-crate medicine crate17)
	(content-crate medicine crate18)
	(content-crate medicine crate19)
	(content-crate medicine crate20)
	(content-crate medicine crate21)
	(content-crate medicine crate22)
	(content-crate medicine crate23)
	(content-crate medicine crate24)
	(content-crate medicine crate25)
	(content-crate medicine crate26)
	(content-crate medicine crate27)
	(person-at person1 loc12)
	(person-at person2 loc26)
	(person-at person3 loc6)
	(person-at person4 loc11)
	(person-at person5 loc14)
	(person-at person6 loc27)
	(person-at person7 loc2)
	(person-at person8 loc4)
	(person-at person9 loc26)
	(person-at person10 loc5)
	(person-at person11 loc23)
	(person-at person12 loc8)
	(person-at person13 loc2)
	(person-at person14 loc27)
	(person-at person15 loc19)
	(person-at person16 loc21)
	(person-at person17 loc18)
	(person-at person18 loc20)
	(person-at person19 loc22)
	(person-at person20 loc3)
	(person-at person21 loc1)
	(person-at person22 loc4)
	(person-at person23 loc21)
	(person-at person24 loc7)
	(person-at person25 loc20)
	(person-at person26 loc27)
	(person-at person27 loc19)
	(next-num N0 N1)
	(next-num N1 N2)
	(next-num N2 N3)
	(next-num N3 N4)
	(next-num N4 N5)
	(next-num N5 N6)
	(next-num N6 N7)
)
(:goal (and
	(drone-at drone1 depot)
	(has-content-person person2 medicine)
	(has-content-person person3 food)
	(has-content-person person3 medicine)
	(has-content-person person4 food)
	(has-content-person person4 medicine)
	(has-content-person person5 food)
	(has-content-person person7 food)
	(has-content-person person7 medicine)
	(has-content-person person8 food)
	(has-content-person person8 medicine)
	(has-content-person person10 food)
	(has-content-person person11 food)
	(has-content-person person11 medicine)
	(has-content-person person15 food)
	(has-content-person person15 medicine)
	(has-content-person person16 food)
	(has-content-person person17 food)
	(has-content-person person18 medicine)
	(has-content-person person19 medicine)
	(has-content-person person20 food)
	(has-content-person person20 medicine)
	(has-content-person person22 medicine)
	(has-content-person person23 food)
	(has-content-person person23 medicine)
	(has-content-person person26 medicine)
	(has-content-person person27 food)
	(has-content-person person27 medicine)
))
)

; plan
1. (put-crate-in-carrier crate27 depot drone1 carrier1 n0 n1)
   deleted: (crates-in-carrier carrier1 n0) (crate-at crate27 depot)
   added: (crates-in-carrier carrier1 n1) (in-carrier crate27 carrier1)
   goals met: 1 of 28
2. (put-crate-in-carrier crate13 depot drone1 carrier1 n1 n2)
   deleted: (crates-in-carrier carrier1 n1) (crate-at crate13 depot)
   added: (crates-in-carrier carrier1 n2) (in-carrier crate13 carrier1)
   goals met: 1 of 28
3. (move-carrier depot loc27 drone1 carrier1)
   deleted: (drone-at drone1 depot) (carrier-at carrier1 depot)
   added: (drone-at drone1 loc27) (carrier-at carrier1 loc27)
   goals met: 0 of 28
4. (pick-and-drop crate27 loc27 drone1 carrier1 person26 medicine n2 n1)
   deleted: (crates-in-carrier carrier1 n2) (in-carrier crate27 carrier1)
   added: (crates-in-carrier carrier1 n1) (has-content-person person26 medicine)
   goals met: 1 of 28
5. (move-carrier loc27 depot drone1 carrier1)
   deleted: (drone-at drone1 loc27) (carrier-at carrier1 loc27)
   added: (drone-at drone1 depot) (carrier-at carrier1 depot)
   goals met: 2 of 28
6. (put-crate-in-carrier crate26 depot drone1 carrier1 n1 n2)
   deleted: (crates-in-carrier carrier1 n1) (crate-at crate26 depot)
   added: (crates-in-carrier carrier1 n2) (in-carrier crate26 carrier1)
   goals met: 2 of 28
7. (move-carrier depot loc26 drone1 carrier1)
   deleted: (drone-at drone1 depot) (carrier-at carrier1 depot)
   added: (drone-at drone1 loc26) (carrier-at carrier1 loc26)
   goals met: 1 of 28
8. (pick-and-drop crate26 loc26 drone1 carrier1 person2 medicine n2 n1)
   deleted: (crates-in-carrier carrier1 n2) (in-carrier crate26 carrier1)
   added: (crates-in-carrier carrier1 n1) (has-content-person person2 medicine)
   goals met: 2 of 28
9. (move-carrier loc26 depot drone1 carrier1)
   deleted: (drone-at drone1 loc26) (carrier-at carrier1 loc26)
   added: (drone-at drone1 depot) (carrier-at carrier1 depot)
   goals met: 3 of 28
10. (put-crate-in-carrier crate25 depot drone1 carrier1 n1 n2)
   deleted: (crates-in-carrier carrier1 n1) (crate-at crate25 depot)
   added: (crates-in-carrier carrier1 n2) (in-carrier crate25 carrier1)
   goals met: 3 of 28
11. (move-carrier depot loc22 drone1 carrier1)
   deleted: (drone-at drone1 depot) (carrier-at carrier1 depot)
   added: (drone-at drone1 loc22) (carrier-at carrier1 loc22)
   goals met: 2 of 28
12. (pick-and-drop crate25 loc22 drone1 carrier1 person19 medicine n2 n1)
   deleted: (crates-in-carrier carrier1 n2) (in-carrier crate25 carrier1)
   added: (crates-in-carrier carrier1 n1) (has-content-person person19 medicine)
   goals met: 3 of 28
13. (move-carrier loc22 depot drone1 carrier1)
   deleted: (drone-at drone1 loc22) (carrier-at carrier1 loc22)
   added: (drone-at drone1 depot) (carrier-at carrier1 depot)
   goals met: 4 of 28
14. (put-crate-in-carrier crate24 depot drone1 carrier1 n1 n2)
   deleted: (crates-in-carrier carrier1 n1) (crate-at crate24 depot)
   added: (crates-in-carrier carrier1 n2) (in-carrier crate24 carrier1)
   goals met: 4 of 28
15. (move-carrier depot loc20 drone1 carrier1)
   deleted: (drone-at drone1 depot) (carrier-at carrier1 depot)
   added: (drone-at drone1 loc20) (carrier-at carrier1 loc20)
   goals met: 3 of 28
16. (pick-and-drop crate24 loc20 drone1 carrier1 person18 medicine n2 n1)
   deleted: (crates-in-carrier carrier1 n2) (in-carrier crate24 carrier1)
   added: (crates-in-carrier carrier1 n1) (has-content-person person18 medicine)
   goals met: 4 of 28
17. (move-carrier loc20 depot drone1 carrier1)
   deleted: (drone-at drone1 loc20) (carrier-at carrier1 loc20)
   added: (drone-at drone1 depot) (carrier-at carrier1 depot)
   goals met: 5 of 28
18. (put-crate-in-carrier crate23 depot drone1 carrier1 n1 n2)
   deleted: (crates-in-carrier carrier1 n1) (crate-at crate23 depot)
   added: (crates-in-carrier carrier1 n2) (in-carrier crate23 carrier1)
   goals met: 5 of 28
19. (move-carrier depot loc18 drone1 carrier1)
   deleted: (drone-at drone1 depot) (carrier-at carrier1 depot)
   added: (drone-at drone1 loc18) (carrier-at carrier1 loc18)
   goals met: 4 of 28
20. (pick-and-drop crate13 loc18 drone1 carrier1 person17 food n2 n1)
   deleted: (crates-in-carrier carrier1 n2) (in-carrier crate13 carrier1)
   added: (crates-in-carrier carrier1 n1) (has-content-person person17 food)
   goals met: 5 of 28
21. (move-carrier loc18 depot drone1 carrier1)
   deleted: (drone-at drone1 loc18) (carrier-at carrier1 loc18)
   added: (drone-at drone1 depot) (carrier-at carrier1 depot)
   goals met: 6 of 28
22. (put-crate-in-carrier crate12 depot drone1 carrier1 n1 n2)
   deleted: (crates-in-carrier carrier1 n1) (crate-at crate12 depot)
   added: (crates-in-carrier carrier1 n2) (in-carrier crate12 carrier1)
   goals met: 6 of 28
23. (move-carrier depot loc14 drone1 carrier1)
   deleted: (drone-at drone1 depot) (carrier-at carrier1 depot)
   added: (drone-at drone1 loc14) (carrier-at carrier1 loc14)
   goals met: 5 of 28
24. (pick-and-drop crate12 loc14 drone1 carrier1 person5 food n2 n1)
   deleted: (crates-in-carrier carrier1 n2) (in-carrier crate12 carrier1)
   added: (crates-in-carrier carrier1 n1) (has-content-person person5 food)
   goals met: 6 of 28
25. (move-carrier loc14 depot drone1 carrier1)
   deleted: (drone-at drone1 loc14) (carrier-at carrier1 loc14)
   added: (drone-at drone1 depot) (carrier-at carrier1 depot)
   goals met: 7 of 28
26. (put-crate-in-carrier crate11 depot drone1 carrier1 n1 n2)
   deleted: (crates-in-carrier carrier1 n1) (crate-at crate11 depot)
   added: (crates-in-carrier carrier1 n2) (in-carrier crate11 carrier1)
   goals met: 7 of 28
27. (move-carrier depot loc5 drone1 carrier1)
   deleted: (drone-at drone1 depot) (carrier-at carrier1 depot)
   added: (drone-at drone1 loc5) (carrier-at carrier1 loc5)
   goals met: 6 of 28
28. (pick-and-drop crate11 loc5 drone1 carrier1 person10 food n2 n1)
   deleted: (crates-in-carrier carrier1 n2) (in-carrier crate11 carrier1)
   added: (crates-in-carrier carrier1 n1) (has-content-person person10 food)
   goals met: 7 of 28
29. (move-carrier loc5 depot drone1 carrier1)
   deleted: (drone-at drone1 loc5) (carrier-at carrier1 loc5)
   added: (drone-at drone1 depot) (carrier-at carrier1 depot)
   goals met: 8 of 28
30. (put-crate-in-carrier crate10 depot drone1 carrier1 n1 n2)
   deleted: (crates-in-carrier carrier1 n1) (crate-at crate10 depot)
   added: (crates-in-carrier carrier1 n2) (in-carrier crate10 carrier1)
   goals met: 8 of 28
31. (put-crate-in-carrier crate22 depot drone1 carrier1 n2 n3)
   deleted: (crates-in-carrier carrier1 n2) (crate-at crate22 depot)
   added: (crates-in-carrier carrier1 n3) (in-carrier crate22 carrier1)
   goals met: 8 of 28
32. (move-carrier depot loc23 drone1 carrier1)
   deleted: (drone-at drone1 depot) (carrier-at carrier1 depot)
   added: (drone-at drone1 loc23) (carrier-at carrier1 loc23)
   goals met: 7 of 28
33. (pick-and-drop crate22 loc23 drone1 carrier1 person11 medicine n3 n2)
   deleted: (crates-in-carrier carrier1 n3) (in-carrier crate22 carrier1)
   added: (crates-in-carrier carrier1 n2) (has-content-person person11 medicine)
   goals met: 8 of 28
34. (pick-and-drop crate10 loc23 drone1 carrier1 person11 food n2 n1)
   deleted: (crates-in-carrier carrier1 n2) (in-carrier crate10 carrier1)
   added: (crates-in-carrier carrier1 n1) (has-content-person person11 food)
   goals met: 9 of 28
35. (move-carrier loc23 depot drone1 carrier1)
   deleted: (drone-at drone1 loc23) (carrier-at carrier1 loc23)
   added: (drone-at drone1 depot) (carrier-at carrier1 depot)
   goals met: 10 of 28
36. (put-crate-in-carrier crate9 depot drone1 carrier1 n1 n2)
   deleted: (crates-in-carrier carrier1 n1) (crate-at crate9 depot)
   added: (crates-in-carrier carrier1 n2) (in-carrier crate9 carrier1)
   goals met: 10 of 28
37. (put-crate-in-carrier crate21 depot drone1 carrier1 n2 n3)
   deleted: (crates-in-carrier carrier1 n2) (crate-at crate21 depot)
   added: (crates-in-carrier carrier1 n3) (in-carrier crate21 carrier1)
   goals met: 10 of 28
38. (move-carrier depot loc21 drone1 carrier1)
   deleted: (drone-at drone1 depot) (carrier-at carrier1 depot)
   added: (drone-at drone1 loc21) (carrier-at carrier1 loc21)
   goals met: 9 of 28
39. (pick-and-drop crate21 loc21 drone1 carrier1 person23 medicine n3 n2)
   deleted: (crates-in-carrier carrier1 n3) (in-carrier crate21 carrier1)
   added: (crates-in-carrier carrier1 n2) (has-content-person person23 medicine)
   goals met: 10 of 28
40. (pick-and-drop crate9 loc21 drone1 carrier1 person16 food n2 n1)
   deleted: (crates-in-carrier carrier1 n2) (in-carrier crate9 carrier1)
   added: (crates-in-carrier carrier1 n1) (has-content-person person16 food)
   goals met: 11 of 28
41. (move-carrier loc21 depot drone1 carrier1)
   deleted: (drone-at drone1 loc21) (carrier-at carrier1 loc21)
   added: (drone-at drone1 depot) (carrier-at carrier1 depot)
   goals met: 12 of 28
42. (put-crate-in-carrier crate8 depot drone1 carrier1 n1 n2)
   deleted: (crates-in-carrier carrier1 n1) (crate-at crate8 depot)
   added: (crates-in-carrier carrier1 n2) (in-carrier crate8 carrier1)
   goals met: 12 of 28
43. (move-carrier depot loc21 drone1 carrier1)
   deleted: (drone-at drone1 depot) (carrier-at carrier1 depot)
   added: (drone-at drone1 loc21) (carrier-at carrier1 loc21)
   goals met: 11 of 28
44. (pick-and-drop crate8 loc21 drone1 carrier1 person23 food n2 n1)
   deleted: (crates-in-carrier carrier1 n2) (in-carrier crate8 carrier1)
   added: (crates-in-carrier carrier1 n1) (has-content-person person23 food)
   goals met: 12 of 28
45. (move-carrier loc21 depot drone1 carrier1)
   deleted: (drone-at drone1 loc21) (carrier-at carrier1 loc21)
   added: (drone-at drone1 depot) (carrier-at carrier1 depot)
   goals met: 13 of 28
46. (put-crate-in-carrier crate7 depot drone1 carrier1 n1 n2)
   deleted: (crates-in-carrier carrier1 n1) (crate-at crate7 depot)
   added: (crates-in-carrier carrier1 n2) (in-carrier crate7 carrier1)
   goals met: 13 of 28
47. (put-crate-in-carrier crate20 depot drone1 carrier1 n2 n3)
   deleted: (crates-in-carrier carrier1 n2) (crate-at crate20 depot)
   added: (crates-in-carrier carrier1 n3) (in-carrier crate20 carrier1)
   goals met: 13 of 28
48. (move-carrier depot loc19 drone1 carrier1)
   deleted: (drone-at drone1 depot) (carrier-at carrier1 depot)
   added: (drone-at drone1 loc19) (carrier-at carrier1 loc19)
   goals met: 12 of 28
49. (pick-and-drop crate20 loc19 drone1 carrier1 person15 medicine n3 n2)
   deleted: (crates-in-carrier carrier1 n3) (in-carrier crate20 carrier1)
   added: (crates-in-carrier carrier1 n2) (has-content-person person15 medicine)
   goals met: 13 of 28
50. (pick-and-drop crate7 loc19 drone1 carrier1 person15 food n2 n1)
   deleted: (crates-in-carrier carrier1 n2) (in-carrier crate7 carrier1)
   added: (crates-in-carrier carrier1 n1) (has-content-person person15 food)
   goals met: 14 of 28
51. (move-carrier loc19 depot drone1 carrier1)
   deleted: (drone-at drone1 loc19) (carrier-at carrier1 loc19)
   added: (drone-at drone1 depot) (carrier-at carrier1 depot)
   goals met: 15 of 28
52. (put-crate-in-carrier crate6 depot drone1 carrier1 n1 n2)
   deleted: (crates-in-carrier carrier1 n1) (crate-at crate6 depot)
   added: (crates-in-carrier carrier1 n2) (in-carrier crate6 carrier1)
   goals met: 15 of 28
53. (put-crate-in-carrier crate19 depot drone1 carrier1 n2 n3)
   deleted: (crates-in-carrier carrier1 n2) (crate-at crate19 depot)
   added: (crates-in-carrier carrier1 n3) (in-carrier crate19 carrier1)
   goals met: 15 of 28
54. (move-carrier depot loc19 drone1 carrier1)
   deleted: (drone-at drone1 depot) (carrier-at carrier1 depot)
   added: (drone-at drone1 loc19) (carrier-at carrier1 loc19)
   goals met: 14 of 28
55. (pick-and-drop crate19 loc19 drone1 carrier1 person27 medicine n3 n2)
   deleted: (crates-in-carrier carrier1 n3) (in-carrier crate19 carrier1)
   added: (crates-in-carrier carrier1 n2) (has-content-person person27 medicine)
   goals met: 15 of 28
56. (pick-and-drop crate6 loc19 drone1 carrier1 person27 food n2 n1)
   deleted: (crates-in-carrier carrier1 n2) (in-carrier crate6 carrier1)
   added: (crates-in-carrier carrier1 n1) (has-content-person person27 food)
   goals met: 16 of 28
57. (move-carrier loc19 depot drone1 carrier1)
   deleted: (drone-at drone1 loc19) (carrier-at carrier1 loc19)
   added: (drone-at drone1 depot) (carrier-at carrier1 depot)
   goals met: 17 of 28
58. (put-crate-in-carrier crate5 depot drone1 carrier1 n1 n2)
   deleted: (crates-in-carrier carrier1 n1) (crate-at crate5 depot)
   added: (crates-in-carrier carrier1 n2) (in-carrier crate5 carrier1)
   goals met: 17 of 28
59. (put-crate-in-carrier crate18 depot drone1 carrier1 n2 n3)
   deleted: (crates-in-carrier carrier1 n2) (crate-at crate18 depot)
   added: (crates-in-carrier carrier1 n3) (in-carrier crate18 carrier1)
   goals met: 17 of 28
60. (move-carrier depot loc11 drone1 carrier1)
   deleted: (drone-at drone1 depot) (carrier-at carrier1 depot)
   added: (drone-at drone1 loc11) (carrier-at carrier1 loc11)
   goals met: 16 of 28
61. (pick-and-drop crate18 loc11 drone1 carrier1 person4 medicine n3 n2)
   deleted: (crates-in-carrier carrier1 n3) (in-carrier crate18 carrier1)
   added: (crates-in-carrier carrier1 n2) (has-content-person person4 medicine)
   goals met: 17 of 28
62. (pick-and-drop crate5 loc11 drone1 carrier1 person4 food n2 n1)
   deleted: (crates-in-carrier carrier1 n2) (in-carrier crate5 carrier1)
   added: (crates-in-carrier carrier1 n1) (has-content-person person4 food)
   goals met: 18 of 28
63. (move-carrier loc11 depot drone1 carrier1)
   deleted: (drone-at drone1 loc11) (carrier-at carrier1 loc11)
   added: (drone-at drone1 depot) (carrier-at carrier1 depot)
   goals met: 19 of 28
64. (put-crate-in-carrier crate4 depot drone1 carrier1 n1 n2)
   deleted: (crates-in-carrier carrier1 n1) (crate-at crate4 depot)
   added: (crates-in-carrier carrier1 n2) (in-carrier crate4 carrier1)
   goals met: 19 of 28
65. (put-crate-in-carrier crate17 depot drone1 carrier1 n2 n3)
   deleted: (crates-in-carrier carrier1 n2) (crate-at crate17 depot)
   added: (crates-in-carrier carrier1 n3) (in-carrier crate17 carrier1)
   goals met: 19 of 28
66. (move-carrier depot loc6 drone1 carrier1)
   deleted: (drone-at drone1 depot) (carrier-at carrier1 depot)
   added: (drone-at drone1 loc6) (carrier-at carrier1 loc6)
   goals met: 18 of 28
67. (pick-and-drop crate17 loc6 drone1 carrier1 person3 medicine n3 n2)
   deleted: (crates-in-carrier carrier1 n3) (in-carrier crate17 carrier1)
   added: (crates-in-carrier carrier1 n2) (has-content-person person3 medicine)
   goals met: 19 of 28
68. (pick-and-drop crate4 loc6 drone1 carrier1 person3 food n2 n1)
   deleted: (crates-in-carrier carrier1 n2) (in-carrier crate4 carrier1)
   added: (crates-in-carrier carrier1 n1) (has-content-person person3 food)
   goals met: 20 of 28
69. (move-carrier loc6 depot drone1 carrier1)
   deleted: (drone-at drone1 loc6) (carrier-at carrier1 loc6)
   added: (drone-at drone1 depot) (carrier-at carrier1 depot)
   goals met: 21 of 28
70. (put-crate-in-carrier crate3 depot drone1 carrier1 n1 n2)
   deleted: (crates-in-carrier carrier1 n1) (crate-at crate3 depot)
   added: (crates-in-carrier carrier1 n2) (in-carrier crate3 carrier1)
   goals met: 21 of 28
71. (put-crate-in-carrier crate16 depot drone1 carrier1 n2 n3)
   deleted: (crates-in-carrier carrier1 n2) (crate-at crate16 depot)
   added: (crates-in-carrier carrier1 n3) (in-carrier crate16 carrier1)
   goals met: 21 of 28
72. (move-carrier depot loc4 drone1 carrier1)
   deleted: (drone-at drone1 depot) (carrier-at carrier1 depot)
   added: (drone-at drone1 loc4) (carrier-at carrier1 loc4)
   goals met: 20 of 28
73. (pick-and-drop crate16 loc4 drone1 carrier1 person8 medicine n3 n2)
   deleted: (crates-in-carrier carrier1 n3) (in-carrier crate16 carrier1)
   added: (crates-in-carrier carrier1 n2) (has-content-person person8 medicine)
   goals met: 21 of 28
74. (pick-and-drop crate3 loc4 drone1 carrier1 person8 food n2 n1)
   deleted: (crates-in-carrier carrier1 n2) (in-carrier crate3 carrier1)
   added: (crates-in-carrier carrier1 n1) (has-content-person person8 food)
   goals met: 22 of 28
75. (move-carrier loc4 depot drone1 carrier1)
   deleted: (drone-at drone1 loc4) (carrier-at carrier1 loc4)
   added: (drone-at drone1 depot) (carrier-at carrier1 depot)
   goals met: 23 of 28
76. (put-crate-in-carrier crate2 depot drone1 carrier1 n1 n2)
   deleted: (crates-in-carrier carrier1 n1) (crate-at crate2 depot)
   added: (crates-in-carrier carrier1 n2) (in-carrier crate2 carrier1)
   goals met: 23 of 28
77. (move-carrier depot loc4 drone1 carrier1)
   deleted: (drone-at drone1 depot) (carrier-at carrier1 depot)
   added: (drone-at drone1 loc4) (carrier-at carrier1 loc4)
   goals met: 22 of 28
78. (pick-and-drop crate23 loc4 drone1 carrier1 person22 medicine n2 n1)
   deleted: (crates-in-carrier carrier1 n2) (in-carrier crate23 carrier1)
   added: (crates-in-carrier carrier1 n1) (has-content-person person22 medicine)
   goals met: 23 of 28
79. (move-carrier loc4 depot drone1 carrier1)
   deleted: (drone-at drone1 loc4) (carrier-at carrier1 loc4)
   added: (drone-at drone1 depot) (carrier-at carrier1 depot)
   goals met: 24 of 28
80. (put-crate-in-carrier crate15 depot drone1 carrier1 n1 n2)
   deleted: (crates-in-carrier carrier1 n1) (crate-at crate15 depot)
   added: (crates-in-carrier carrier1 n2) (in-carrier crate15 carrier1)
   goals met: 24 of 28
81. (put-crate-in-carrier crate14 depot drone1 carrier1 n2 n3)
   deleted: (crates-in-carrier carrier1 n2) (crate-at crate14 depot)
   added: (crates-in-carrier carrier1 n3) (in-carrier crate14 carrier1)
   goals met: 24 of 28
82. (move-carrier depot loc3 drone1 carrier1)
   deleted: (drone-at drone1 depot) (carrier-at carrier1 depot)
   added: (drone-at drone1 loc3) (carrier-at carrier1 loc3)
   goals met: 23 of 28
83. (pick-and-drop crate14 loc3 drone1 carrier1 person20 medicine n3 n2)
   deleted: (crates-in-carrier carrier1 n3) (in-carrier crate14 carrier1)
   added: (crates-in-carrier carrier1 n2) (has-content-person person20 medicine)
   goals met: 24 of 28
84. (move-carrier loc3 loc2 drone1 carrier1)
   deleted: (drone-at drone1 loc3) (carrier-at carrier1 loc3)
   added: (drone-at drone1 loc2) (carrier-at carrier1 loc2)
   goals met: 24 of 28
85. (pick-and-drop crate15 loc2 drone1 carrier1 person7 medicine n2 n1)
   deleted: (crates-in-carrier carrier1 n2) (in-carrier crate15 carrier1)
   added: (crates-in-carrier carrier1 n1) (has-content-person person7 medicine)
   goals met: 25 of 28
86. (pick-and-drop crate2 loc2 drone1 carrier1 person7 food n1 n0)
   deleted: (crates-in-carrier carrier1 n1) (in-carrier crate2 carrier1)
   added: (crates-in-carrier carrier1 n0) (has-content-person person7 food)
   goals met: 26 of 28
87. (move-carrier loc2 depot drone1 carrier1)
   deleted: (drone-at drone1 loc2) (carrier-at carrier1 loc2)
   added: (drone-at drone1 depot) (carrier-at carrier1 depot)
   goals met: 27 of 28
88. (put-crate-in-carrier crate1 depot drone1 carrier1 n0 n1)
   deleted: (crates-in-carrier carrier1 n0) (crate-at crate1 depot)
   added: (crates-in-carrier carrier1 n1) (in-carrier crate1 carrier1)
   goals met: 27 of 28
89. (move-carrier depot loc3 drone1 carrier1)
   deleted: (drone-at drone1 depot) (carrier-at carrier1 depot)
   added: (drone-at drone1 loc3) (carrier-at carrier1 loc3)
   goals met: 26 of 28
90. (pick-and-drop crate1 loc3 drone1 carrier1 person20 food n1 n0)
   deleted: (crates-in-carrier carrier1 n1) (in-carrier crate1 carrier1)
   added: (crates-in-carrier carrier1 n0) (has-content-person person20 food)
   goals met: 27 of 28
91. (move-carrier loc3 depot drone1 carrier1)
   deleted: (drone-at drone1 loc3) (carrier-at carrier1 loc3)
   added: (drone-at drone1 depot) (carrier-at carrier1 depot)
   goals met: 28 of 28
